Merge pull request #1 from pisigmac/dev
New Features addition
